software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertCollectionProtocolWithEvents.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active"
                                          aliquotInSameContainer="false"
                                          consentsWaived="false"
                                          dirtyEditFlag="false"
                                          identifier="0"
                                          remoteId="006"
                                          remoteManagedFlag="false"
                                          shortTitle="CP Short Title - A006"
                                          startDate="2011-08-11T13:58:22.790Z"
                                          studyCalendarEventPoint="0.0"
                                          title="CP Title - A006"
                                          xsi:type="ns2:CollectionProtocol"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">

                    <ns2:collectionProtocolEventCollection>
                        <ns2:CollectionProtocolEvent
                                activityStatus="Active"
                                clinicalDiagnosis="Not Specified"
                                clinicalStatus="Not Specified"
                                collectionPointLabel="CPE Point Label" identifier="0"
                                labelFormat="%CP_DEFAULT%" studyCalendarEventPoint="5.0">

                            <ns2:specimenCollectionSite>
                                <ns2:Site dirtyEditFlag="false" identifier="1" remoteId="0" remoteManagedFlag="false"/>
                            </ns2:specimenCollectionSite>

                        </ns2:CollectionProtocolEvent>
                    </ns2:collectionProtocolEventCollection>

                    <ns2:principalInvestigator>
                        <ns2:User identifier="1"/>
                    </ns2:principalInvestigator>

                    <ns2:coordinatorCollection>
                        <ns2:User identifier="2"/>
                    </ns2:coordinatorCollection>

                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>